Revit 2027 API
RebarSpliceTypeUtils.SetLapLengthMultiplier Method
 Sets the lap length multiplier value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetLapLengthMultiplier(
	Document document,
	ElementId rebarSpliceTypeId,
	double lapLengthMultiplier
)
Public Shared Sub SetLapLengthMultiplier (
	document As Document,
	rebarSpliceTypeId As ElementId,
	lapLengthMultiplier As Double
)
public:
static void SetLapLengthMultiplier(
	Document^ document,
	ElementId^ rebarSpliceTypeId,
	double lapLengthMultiplier
)
static member SetLapLengthMultiplier :
        document : Document *
        rebarSpliceTypeId : ElementId *
        lapLengthMultiplier : float -> unit
Parameters
document Document
 The document.
rebarSpliceTypeId ElementId
 The Rebar Splice Type id.
lapLengthMultiplier Double
 The lap length multiplier value.
Exceptions
Exception | Condition
ArgumentException |  The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for lapLengthMultiplier must be non-negative.
See Also
Reference
RebarSpliceTypeUtils Class
Autodesk.Revit.DB.Structure Namespace